[
  {
    "title": "Starmer set to announce UK recognition of Palestinian state",
    "link": "https://www.bbc.com/news/articles/ce800enrglzo?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sun, 21 Sep 2025 09:30:04 GMT",
    "content": "A host of countries, including France and Canada, are expected to do the same when world leaders gather at the UN General Assembly next week."
  },
  {
    "title": "Israel will occupy more West Bank land, but recognition matters, mayor tells BBC",
    "link": "https://www.bbc.com/news/articles/c0ez9qxzl2jo?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sun, 21 Sep 2025 05:01:20 GMT",
    "content": "Palestinians living in the West Bank describe the impact of Israel's occupying control."
  },
  {
    "title": "Duchess of York called Epstein 'supreme friend' in 2011 email ",
    "link": "https://www.bbc.com/news/articles/cgj11l3wd35o?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sun, 21 Sep 2025 09:02:38 GMT",
    "content": "A spokesperson for the duchess says the message was sent to counter a threat Epstein had made to sue her for defamation."
  },
  {
    "title": "Heathrow braces for second day of disruption after cyber-attack",
    "link": "https://www.bbc.com/news/articles/cwy88857llno?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sun, 21 Sep 2025 09:17:40 GMT",
    "content": "The issue affecting check-in and baggage systems caused hundreds of delays and cancellations on Saturday."
  },
  {
    "title": "How Russian-funded fake news network aims to disrupt election in Europe - BBC investigation",
    "link": "https://www.bbc.com/news/articles/c4g5kl0n5d2o?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sun, 21 Sep 2025 08:26:04 GMT",
    "content": "An undercover reporter discovers a network is offering to pay for social media posts undermining Moldova’s ruling party. \n\n"
  },
  {
    "title": "Ed Davey urges regulator to go after Musk over X 'crimes'",
    "link": "https://www.bbc.com/news/articles/c5y558r2r1qo?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sun, 21 Sep 2025 09:12:54 GMT",
    "content": "The Lib Dem leader urges Ofcom to launch an investigation into the tech mogul and his social platform."
  },
  {
    "title": "Veteran broadcaster John Stapleton dies aged 79",
    "link": "https://www.bbc.com/news/articles/c9300xw27vgo?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sun, 21 Sep 2025 09:58:33 GMT",
    "content": "The presenter, who featured on the BBC's Watchdog, had been diagnosed with Parkinson's disease."
  },
  {
    "title": "Creatine - can this muscle-boosting supplement help sharpen my brain?",
    "link": "https://www.bbc.com/news/articles/c2lx7klzvpko?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sat, 20 Sep 2025 23:02:35 GMT",
    "content": "As its popularity grows, research suggests creatine may also benefit short-term memory, mood and focus."
  },
  {
    "title": "Why Starmer decided the time was right to recognise a Palestinian state",
    "link": "https://www.bbc.com/news/articles/cp9848kxp2go?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sat, 20 Sep 2025 23:02:17 GMT",
    "content": "The PM had signalled a shift in policy unless Israel took steps including agreeing to a ceasefire in Gaza."
  },
  {
    "title": "I took a job on a whim on New Year's Eve - and ended up stranded at sea for six months",
    "link": "https://www.bbc.com/news/articles/crev9y77njpo?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sun, 21 Sep 2025 00:07:39 GMT",
    "content": "What would you do if you were stuck on a ship, far from loved ones, and you had no idea how - or when - you’d get home?"
  },
  {
    "title": "The close friends going head-to-head as a British gold-medal showdown awaits",
    "link": "https://www.bbc.com/sport/athletics/articles/c2061rzx7k1o?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sun, 21 Sep 2025 08:11:27 GMT",
    "content": "Olympic 1500m medallist Georgia Hunter Bell says sharing the world 800m podium with team-mate Keely Hodgkinson would \"be the coolest thing ever\"."
  },
  {
    "title": "My student loan doesn't cover my bills, so I wear my work uniform to lectures",
    "link": "https://www.bbc.com/news/articles/cly68e6r621o?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sat, 20 Sep 2025 23:02:45 GMT",
    "content": "As students struggle to cover the cost of university, the BBC speaks to young people to find out how they make it work."
  },
  {
    "title": "Heightened security as Americans gather for Kirk memorial ",
    "link": "https://www.bbc.com/news/articles/c5yqqelk39go?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sat, 20 Sep 2025 23:02:10 GMT",
    "content": "Donald Trump and JD Vance will be among the speakers at the event in Arizona."
  },
  {
    "title": "Charlie Kirk, the conservative influencer who became the voice of Maga youth",
    "link": "https://www.bbc.com/news/articles/cdxqnkwerj7o?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sat, 20 Sep 2025 23:28:44 GMT",
    "content": "The influential Trump ally who at age 18 set up Turning Point USA died in a shooting while speaking at a Utah campus event."
  },
  {
    "title": "Villa v Liverpool match postponed following ex-manager's death",
    "link": "https://www.bbc.com/sport/football/articles/ckgee1yd46ko?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sun, 21 Sep 2025 09:10:21 GMT",
    "content": "Liverpool's Women's Super League match at Aston Villa on Sunday is postponed following the death of former manager Matt Beard."
  },
  {
    "title": "Hamnet to Sinners: 12 films to look out for as Oscars race begins",
    "link": "https://www.bbc.com/news/articles/cd9y7qx7gqno?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sat, 20 Sep 2025 23:03:11 GMT",
    "content": "The top contenders for Hollywood’s awards season have emerged following the autumn film festivals."
  },
  {
    "title": "The Papers: 'The actual state of Palestine' and 'Fergie's apology'",
    "link": "https://www.bbc.com/news/articles/cn4llyxdl3yo?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sat, 20 Sep 2025 23:38:45 GMT",
    "content": "Sir Keir Starmer's plan to announce the recognition of a Palestinian state features prominently on Sunday's papers."
  },
  {
    "title": "Dating apps, booze and clubbing - Jane Austen's Emma comes into the 21st Century",
    "link": "https://www.bbc.com/news/articles/c8rvd5lrv6po?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sat, 20 Sep 2025 23:03:39 GMT",
    "content": "A new play based on Austen's classic novel places the book's central character in modern-day Essex."
  },
  {
    "title": "Stab-proof vests to be given to thousands of prison officers",
    "link": "https://www.bbc.com/news/articles/c4gkkegl193o?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sun, 21 Sep 2025 08:59:12 GMT",
    "content": "Justice Secretary David Lammy is trying to improve jail safety after several high-profile attacks. "
  },
  {
    "title": "RAF jets join Nato air defence mission over Poland",
    "link": "https://www.bbc.com/news/articles/c4g7752w1ygo?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sat, 20 Sep 2025 21:00:49 GMT",
    "content": "Tensions have risen across Europe after 19 drones entered Polish territory earlier this month."
  },
  {
    "title": "Curtain rises on Strictly 2025 as new couples revealed ",
    "link": "https://www.bbc.com/news/articles/cy9nnl78dgzo?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sat, 20 Sep 2025 21:42:41 GMT",
    "content": "Saturday's spectacular saw a performance by last year's winners Chris McCausland and Dianne Buswell, along with pop star Jessie J. "
  },
  {
    "title": "British couple held by Taliban arrive in UK after release",
    "link": "https://www.bbc.com/news/articles/cly6ve2dg66o?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sun, 21 Sep 2025 07:13:14 GMT",
    "content": "Their son tells the BBC he is \"overwhelmed\" by release after nearly eight months in prison."
  },
  {
    "title": "Murdered Kenyan's friends want UK soldier to face justice",
    "link": "https://www.bbc.com/news/articles/ce3yn033xewo?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sun, 21 Sep 2025 08:21:05 GMT",
    "content": "Friends of the stabbed 21-year-old Kenyan woman recount to the BBC events on the night she went missing."
  },
  {
    "title": "Vietnamese singer Duc Phuc wins Russia's Intervision song contest",
    "link": "https://www.bbc.com/news/videos/cvg998q0557o?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sun, 21 Sep 2025 04:17:42 GMT",
    "content": "Vietnam was among 23 countries competing in a glitzy Russian song contest, revived three years after Russia was banned from Eurovision."
  },
  {
    "title": "Play now",
    "link": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sun, 21 Sep 2025 04:43:48 GMT",
    "content": "Think you can work out where's hotter and colder than you today? Find out by playing our game"
  },
  {
    "title": "BBC News app",
    "link": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "pubDate": "Wed, 30 Apr 2025 14:04:28 GMT",
    "content": "Top stories, breaking news, live reporting, and follow news topics that match your interests"
  },
  {
    "title": "Villa v Liverpool postponed following Beard's death",
    "link": "https://www.bbc.com/sport/football/articles/ckgee1yd46ko?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sun, 21 Sep 2025 09:10:21 GMT",
    "content": "Liverpool's Women's Super League match at Aston Villa on Sunday is postponed following the death of former manager Matt Beard."
  },
  {
    "title": "Why Arsenal and Man City are bringing back long-ball football",
    "link": "https://www.bbc.com/sport/football/articles/cvg00wx7j42o?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sun, 21 Sep 2025 05:15:55 GMT",
    "content": "Arsenal and Manchester City have been known for their intricate football, so why are they now starting to go long more often?"
  },
  {
    "title": "'Incredible' Kildunne turns on swagger as England reach World Cup final",
    "link": "https://www.bbc.com/sport/rugby-union/articles/c2377veer32o?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sat, 20 Sep 2025 19:00:04 GMT",
    "content": "Ellie Kildunne is the face of the Women's Rugby World Cup. Against France, she finally delivered the A-list performance she is capable of."
  },
  {
    "title": "Fritz stuns Alcaraz to turn tide for Team World in Laver Cup",
    "link": "https://www.bbc.com/sport/tennis/articles/c1jzz88g58do?at_medium=RSS&at_campaign=rss",
    "pubDate": "Sun, 21 Sep 2025 09:24:43 GMT",
    "content": "American Taylor Fritz stuns world number one Carlos Alcaraz as Team World turn things around to take a 9-3 lead on day two of the Laver Cup."
  },
  {
    "title": "Some on-air claims about Dominion Voting Systems were false, Fox News acknowledges in statement after deal is announced",
    "link": "https://www.cnn.com/business/live-news/fox-news-dominion-trial-04-18-23/index.html",
    "pubDate": "Wed, 19 Apr 2023 12:44:51 GMT"
  },
  {
    "title": "Dominion still has pending lawsuits against election deniers such as Rudy Giuliani and Sidney Powell",
    "link": "https://www.cnn.com/business/live-news/fox-news-dominion-trial-04-18-23/h_8d51e3ae2714edaa0dace837305d03b8"
  },
  {
    "title": "Here are the 20 specific Fox broadcasts and tweets Dominion says were defamatory",
    "link": "https://www.cnn.com/2023/04/17/media/dominion-fox-news-allegations/index.html",
    "pubDate": "Mon, 17 Apr 2023 16:01:11 GMT",
    "content": "• Fox-Dominion trial delay 'is not unusual,' judge says\n• Fox News' defamation battle isn't stopping Trump's election lies"
  },
  {
    "title": "Judge in Fox News-Dominion defamation trial: 'The parties have resolved their case'",
    "link": "https://www.cnn.com/2023/04/18/media/fox-dominion-settlement/index.html",
    "pubDate": "Wed, 19 Apr 2023 08:28:17 GMT",
    "content": "The judge just announced in court that a settlement has been reached in the historic defamation case between Fox News and Dominion Voting Systems."
  },
  {
    "title": "'Difficult to say with a straight face': Tapper reacts to Fox News' statement on settlement",
    "link": "https://www.cnn.com/videos/politics/2023/04/18/jake-tapper-dominion-lawsuit-settlement-fox-news-statement-lead-vpx.cnn",
    "pubDate": "Tue, 18 Apr 2023 21:17:44 GMT",
    "content": "A settlement has been reached in Dominion Voting Systems' defamation case against Fox News, the judge for the case announced. The network will pay more than $787 million to Dominion, a lawyer for the company said."
  },
  {
    "title": "Millions in the US could face massive consequences unless McCarthy can navigate out of a debt trap he set for Biden",
    "link": "https://www.cnn.com/2023/04/18/politics/mccarthy-biden-debt-ceiling/index.html",
    "pubDate": "Tue, 18 Apr 2023 20:34:45 GMT",
    "content": "• DeSantis goes to Washington, a place he once despised, looking for support to take on Trump\n• Opinion: For the GOP to win, it must ditch Trump\n• Chris Christie mulling 2024 White House bid\n• Analysis: The fire next time has begun burning in Tennessee "
  },
  {
    "title": "White homeowner accused of shooting a Black teen who rang his doorbell turns himself in to face criminal charges",
    "link": "https://www.cnn.com/2023/04/18/us/kansas-city-ralph-yarl-shooting-tuesday/index.html",
    "pubDate": "Wed, 19 Apr 2023 04:29:05 GMT",
    "content": "• 'A major part of Ralph died': Aunt of teen shot after ringing wrong doorbell speaks\n• 20-year-old woman shot after friend turned into the wrong driveway in upstate New York, officials say"
  },
  {
    "title": "Newly released video shows scene of Jeremy Renner's snowplow accident",
    "link": "https://www.cnn.com/videos/us/2023/04/18/jeremy-renner-snowplow-accident-bodycam-nc-melas-contd-vpx.cnn",
    "pubDate": "Tue, 18 Apr 2023 14:09:43 GMT",
    "content": "Newly released body camera footage shows firefighters and sheriff's deputies rushing to help actor Jeremy Renner after a near-fatal snowplow accident in January. The \"Avengers\" actor broke more than 30 bones and suffered other severe injuries. CNN's Chloe Melas has more. "
  },
  {
    "title": "Jake Gyllenhaal and Jamie Lee Curtis spent the Covid-19 lockdown together",
    "link": "https://www.cnn.com/2023/04/18/entertainment/jake-gyllenhaal-jamie-lee-curtis-pandemic-living/index.html",
    "pubDate": "Tue, 18 Apr 2023 14:40:32 GMT",
    "content": "It's sourdough bread and handstands for Jake Gyllenhaal and Jamie Lee Curtis."
  },
  {
    "title": "Toddler crawls through White House fence, prompts Secret Service response",
    "link": "https://www.cnn.com/2023/04/18/politics/white-house-toddler/index.html",
    "pubDate": "Tue, 18 Apr 2023 17:38:16 GMT",
    "content": "A tiny intruder infiltrated White House grounds Tuesday, prompting a swift response from the US Secret Service."
  },
  {
    "title": "Jamie Foxx remains hospitalized nearly a week after 'medical complication'",
    "link": "https://www.cnn.com/2023/04/17/entertainment/jamie-foxx-remains-hospitalized/index.html",
    "pubDate": "Tue, 18 Apr 2023 00:27:07 GMT",
    "content": "Jamie Foxx remains hospitalized in Georgia nearly a week after his daughter revealed the actor experienced a \"medical complication,\" a source with knowledge of the matter told CNN on Monday."
  },
  {
    "title": "A 13-year-old dies after participating in a Benadryl TikTok 'challenge'",
    "link": "https://www.cnn.com/2023/04/18/us/benadryl-tiktok-challenge-teen-death-wellness/index.html",
    "pubDate": "Wed, 19 Apr 2023 15:01:06 GMT",
    "content": "A 13-year-old in Ohio has died after \"he took a bunch of Benadryl,\" trying a dangerous TikTok challenge that's circulating online, according to a CNN affiliate and a GoFundMe account from his family."
  },
  {
    "title": "See pizza delivery guy take out suspect fleeing police",
    "link": "https://www.cnn.com/videos/us/2023/04/18/pizza-guy-trips-perp-moos-cprog-orig-bdk.cnn",
    "pubDate": "Tue, 18 Apr 2023 16:40:22 GMT",
    "content": "Pizza guy delivers more than a pie, taking out a fleeing suspect. CNN's Jeanne Moos shows him putting his best foot forward."
  },
  {
    "title": "Netflix is winding down its DVD business after 25 years",
    "link": "https://www.cnn.com/2023/04/18/media/netflix-dvd-red-envelopes/index.html",
    "pubDate": "Tue, 18 Apr 2023 20:10:51 GMT",
    "content": "Netflix is officially winding down the business that helped make it a household name. "
  },
  {
    "title": "FTC chair Lina Khan warns AI could 'turbocharge' fraud and scams",
    "link": "https://www.cnn.com/2023/04/18/tech/lina-khan-ai-warning/index.html",
    "pubDate": "Tue, 18 Apr 2023 17:59:38 GMT",
    "content": "Artificial intelligence tools such as ChatGPT could lead to a \"turbocharging\" of consumer harms including fraud and scams, and the US government has substantial authority to crack down on AI-driven consumer harms under existing law, members of the Federal Trade Commission said Tuesday. "
  },
  {
    "title": "Eating too much of these foods is driving the rise in type 2 diabetes, study says",
    "link": "https://www.cnn.com/2023/04/17/health/rise-type-2-diabetes-global-wellness/index.html",
    "pubDate": "Mon, 17 Apr 2023 16:02:46 GMT",
    "content": "Gobbling up too many refined wheat and rice products, along with eating too few whole grains, is fueling the growth of new cases of type 2 diabetes worldwide, according to a new study that models data through 2018."
  },
  {
    "title": "ADHD medication abuse in schools is a 'wake-up call'",
    "link": "https://www.cnn.com/2023/04/18/health/teen-misuse-adhd-meds-wellness/index.html",
    "pubDate": "Tue, 25 Apr 2023 17:44:36 GMT",
    "content": "At some middle and high schools in the United States, 1 in 4 teens report they've abused prescription stimulants for attention deficit hyperactivity disorder during the year prior, a new study found. "
  },
  {
    "title": "Apple CEO was presented with an original Macintosh. See his reaction",
    "link": "https://www.cnn.com/videos/tech/2023/04/18/apple-store-mumbai-india-ceo-tim-cook-vedika-sud-ovn-biz-ldn-vpx.cnn",
    "pubDate": "Tue, 18 Apr 2023 09:17:25 GMT",
    "content": "CEO Tim Cook personally welcomed customers to the new Apple store in Mumbai as the tech company opens its first retail stores in India. CNN's Vedika Sud reports. "
  },
  {
    "title": "Democrats bash Justice Clarence Thomas but their plan to investigate ethics allegations is unclear",
    "link": "https://www.cnn.com/2023/04/18/politics/clarence-thomas-ethics-democrats/index.html",
    "pubDate": "Tue, 18 Apr 2023 20:29:46 GMT",
    "content": "Senate Democrats railed against Justice Clarence Thomas on Tuesday amid reports that the Supreme Court conservative failed to disclose luxury travel, gifts and a real estate transaction involving a GOP megadonor, but their plan to investigate the conservative jurist remains unclear.  "
  },
  {
    "title": "Russia is 'going backwards' in equipment and deploying post WWII-era tanks, according to Western officials",
    "link": "https://www.cnn.com/europe/live-news/russia-ukraine-war-news-04-18-23/index.html",
    "content": "• Jailed Wall Street Journal reporter Evan Gershkovich denied detention appeal in Moscow\n• Putin visits Russian troops at military headquarters in Kherson\n• Watch moment WSJ journalist appears in Russian court"
  },
  {
    "title": "Two Russians claiming to be former Wagner commanders admit killing children and civilians in Ukraine",
    "link": "https://www.cnn.com/2023/04/17/europe/wagner-commanders-russia-kill-children-intl-hnk/index.html",
    "pubDate": "Tue, 18 Apr 2023 19:07:52 GMT",
    "content": "Two Russian men who claim to be former Wagner Group commanders have told a human rights activist that they killed children and civilians during their time in Ukraine. "
  },
  {
    "title": "'My stomach is hurting from laughing': Hear panelist's reaction to DeSantis' threat to Disney",
    "link": "https://www.cnn.com/videos/business/2023/04/18/desantis-disney-competition-panel-reax-pt-vpx.cnn",
    "pubDate": "Tue, 18 Apr 2023 03:24:56 GMT",
    "content": "CNN panelists react to Florida Gov. Ron DeSantis floating the idea of building a competing theme park next to Disney World in Orlando."
  },
  {
    "title": "GOP prepared to block vote to replace Feinstein on Senate Judiciary",
    "link": "https://www.cnn.com/2023/04/18/politics/schumer-senate-feinstein-vote-cardin/index.html",
    "pubDate": "Tue, 18 Apr 2023 22:03:13 GMT",
    "content": "Senate Majority Leader Chuck Schumer said on Tuesday that he hopes to replace Democratic Sen. Dianne Feinstein on the Senate Judiciary Committee with Sen. Ben Cardin of Maryland and aims to set up a floor vote on the issue this afternoon, which Republicans are expected to block. "
  },
  {
    "title": "Oklahoma governor calls on officials to resign over recording of racist and threatening remarks",
    "link": "https://www.cnn.com/2023/04/18/us/mccurtain-county-oklahoma-officials-recording/index.html",
    "pubDate": "Tue, 18 Apr 2023 17:33:17 GMT"
  },
  {
    "title": "McCarthy slams Biden in handling of US debt ",
    "link": "https://www.cnn.com/videos/politics/2023/04/18/kevin-mccarthy-wall-street-speech-debt-ceiling-biden-economy-vpx.cnn",
    "pubDate": "Tue, 18 Apr 2023 22:03:01 GMT",
    "content": "House Speaker Kevin McCarthy traveled to Wall Street on Monday to deliver a fresh warning that the House GOP majority will refuse to lift a cap on government borrowing unless Biden agrees to spending cuts that would effectively neutralize his domestic agenda."
  },
  {
    "title": "US warns Russia not to touch American nuclear technology at Ukrainian nuclear plant",
    "link": "https://www.cnn.com/2023/04/18/politics/us-warns-russia-zaporizhzhia-nuclear-plant/index.html",
    "pubDate": "Wed, 19 Apr 2023 08:35:33 GMT",
    "content": "The US has sensitive nuclear technology at a nuclear power plant inside Ukraine and is warning Russia not to touch it, according to a letter the US Department of Energy sent to Russia's state-owned nuclear energy firm Rosatom last month."
  },
  {
    "title": "Repeated gunshots fired on live TV as ex-lawmaker shot by assassins",
    "link": "https://www.cnn.com/videos/world/2023/04/18/india-ex-lawmaker-atiq-ahmed-assassination-sud-pkg-contd-ovn-intl-hnk-vpx.cnn",
    "pubDate": "Tue, 18 Apr 2023 09:41:42 GMT",
    "content": "Atiq Ahmed, a former lawmaker in India's parliament, convicted of kidnapping, was shot dead along with his brother while police were escorting them for a medical check-up in a slaying caught on live television on Saturday. CNN's Vedika Sud reports."
  },
  {
    "title": "FDA clears the way for additional bivalent boosters for certain vulnerable individuals",
    "link": "https://www.cnn.com/2023/04/18/health/fda-bivalent-booster-additional-doses/index.html",
    "pubDate": "Tue, 18 Apr 2023 15:09:15 GMT",
    "content": "The U.S. Food and Drug Administration amended the terms of its emergency use authorizations for the Pfizer and Moderna bivalent vaccines on Tuesday, allowing people ages 65 and older and certain people with weakened immunity to get additional doses before this fall's vaccination campaigns."
  },
  {
    "title": "Maine authorities detained a person of interest after 4 people were found dead in a home and 3 others shot while driving",
    "link": "https://www.cnn.com/2023/04/18/us/maine-shooting-bowdoin-yarmouth/index.html",
    "pubDate": "Wed, 19 Apr 2023 01:49:51 GMT",
    "content": "Maine authorities have detained a person of interest and continue to investigate after two shooting incidents that appear to be connected left at least four people dead and three others injured, state police said. "
  },
  {
    "title": "Southwest says flights resumed after delays caused by 'tech issues'",
    "link": "https://www.cnn.com/travel/article/southwest-airlines-flight-delays/index.html",
    "pubDate": "Tue, 18 Apr 2023 17:15:29 GMT",
    "content": "• Delta Air Lines reports record bookings for summer travel\n• Air France and Airbus acquitted in trial over 2009 plane crash"
  }
]